wsdialog.tex
% Created 2017-04-17 Mo 23:47
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{andrei}
\date{\today}
\title{WS Dialog}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Description}
\label{sec-1}
WS-style dialog

\begin{verbatim}
<message>: <enter text>
 *RETURN* done | *Backspace* or *^H* erase left
  *^U* cancel  |       *Del* or *^G* erase char
<Line4>
\end{verbatim}

\subsection{Main Mode}
\label{sec-1-1}
\begin{itemize}
\item On init: display first 3 lines
\item On \^{}U: exit dialog (run restore function)
\item On \^{}M/Enter: run accept function, run restore function
\end{itemize}

Accept function: exits or enters one of the Line4 modes, based on the
input.

\subsection{Line4 modes}
\label{sec-1-2}
Line4 modes are used if the input cannot be accepted.  They dislay an
error message and wait for input 
\begin{itemize}
\item \^{}U/: exit Line4 mode, hide Line4, return to prompt
\item Other keys can be used to run a custom function
\item Or can be set to use text input + \^{}M/Enter => accept function
\end{itemize}

\subsection{Example: block save dialog}
\label{sec-1-3}
\begin{itemize}
\item message= \texttt{Write to file}
\item accept function: try to save a string as a file, if file exists,
then enter \emph{Line4-exists} mode, if write error, enter
\emph{Line4-write-error} mode.
\end{itemize}

\subsubsection{Line4-exists mode}
\label{sec-1-3-1}
\begin{itemize}
\item message: \texttt{\#That file already exists.\#  Overwrite (Y/N)?} \footnote{\texttt{\#<string>\#} means that the string format is \textbf{standout}.}
\item y/Y: same as the main accept function
\item n/N: same as \^{}U (delete Line4, return to prompt)
\end{itemize}

\subsubsection{Line4-write-error mode}
\label{sec-1-3-2}
\begin{itemize}
\item message: \texttt{\#Error writing file <fn>.\# Press Enter to continue.}
\item \^{}M/Enter/$^{\text{U}}$: delete Line4, return to prompt
\end{itemize}

\subsection{Interface}
\label{sec-1-4}
Every dialog is a mode and every Line4 of a dialog is a mode.  Every
dialog has a string identifier, which is used to identify the dialog
mode: \verb~wsdialog_<dialog-id>~ (further: \verb~<DID>~).  All the \verb~<DID>~ must
be strored in the \verb~wsdialog_modes~ array.

Every Line4 mode of a dialog is identified as \verb~<DID>_<id>~ (further:
\verb~<l4id>~).  All the \verb~<l4id>~ must be stored in a \verb~<DID>_modes~ array.

\verb~<DID>~ and \verb~<l4id>~ must be non-null strings.

\subsubsection{Message}
\label{sec-1-4-1}
\verb~<DID>_msg~ variable

\subsubsection{Line4 modes}
\label{sec-1-4-2}
\begin{itemize}
\item message: \verb~<l4id>_msg~ variables
\item enter string and \^{}M/Enter: accept function:
\verb~<l4id>_accept~ variable contains accept function name.
If defined, string mode, otherwise read key mode.
\item single key press corresponding different functions:
\end{itemize}
stored in an associative array, \verb~<l4id>_fn~ where the key is the
key sequence or combination to be used with \verb~bindkey~ for function
identification, and the value is the function name.

\subsection{Configuration}
\label{sec-1-5}
\subsubsection{Create a dialog}
\label{sec-1-5-1}
\begin{itemize}
\item \verb~<DID>~ is the name of the dialog
\item add dialog to \verb~wsdialog_modes~ array
\item \verb~<DID>_msg~ is the message
\item \verb~<DID>_accept~ is the accept function
\item \verb~<DID>_restore~ is the restore function, called after dialog has
finished, on success or on cancel
\end{itemize}

\subsubsection{Define Line4 modes}
\label{sec-1-5-2}
For each Line4
\begin{itemize}
\item choose a name: \verb~<DID>_<name>~ is the Line4 identifier \verb~<l4id>~
\item Line4 modes can be of two different types, determined by whether
the \verb~<l4id>_accept~ function is defined or not:
\begin{itemize}
\item if it is an \emph{accept} type Line4, define an accept function and
\end{itemize}
store it in \verb~<l4id>_accept~
\begin{itemize}
\item if it is a \emph{key} type Line4, define for each key sequence
\end{itemize}
\verb~<key>~ a function \verb~<func>~ and store them in th \verb~<l4id>_fns~ array
as key-value pairs
\end{itemize}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}
